const i18n = {
  'zh': ['账户', '帳戶', '', ''],
  'yh': ['用户', '用戶', '', ''],
  'xm': ['姓名', '姓名', '', ''],
  'mc': ['名称', '名稱', '', ''],
  'jjmc': ['角色名称', '角色名稱', '', ''],
  'mx': ['描述', '描述', '', ''],
  'zzjg': ['组织机构', '組織機構', '', ''],
  'zt': ['状态', '狀態', '', ''],
  'yx': ['邮箱', '郵箱', '', ''],
  'lxdh': ['联系电话', '聯繫電話', '', ''],
  'yy': ['语言', '語言', '', ''],
  'xh': ['序号', '序號', '', ''],
  'caoz': ['操作', '操作', '', ''],

  'cz': ['重置', '重置', '', ''],
  'xz': ['新增', '新增', '', ''],
  'cx': ['查询', '查詢', '', ''],
  'sc': ['删除', '刪除', '', ''],

  'qxzzt': ['请选择状态', '請選擇狀態', '', ''],
  'qssyw': ['请使用英文字母和数字组成帐户!', '請使用英文字母和數字組成帳戶!', '', ''],
  'qtxzh': ['请填写账户!', '請填寫帳戶!', '', ''],
  'qttxm': ['请填写姓名', '請填寫姓名', '', ''],
  'qxzzzjg': ['请选择组织机构', '請選擇組織機構', '', ''],
  'qtxzqyx': ['请填写正确邮箱', '請填寫正確郵箱', '', ''],
  'qtxlxdh': ['请填写联系电话', '請填寫聯繫電話', '', ''],
  'qxzyy': ['请选择语言', '請選擇語言', '', ''],

  'bcsb': ['保存失败！', '保存失敗！', '', ''],
  'ccsb': ['创建失败！', '創建失敗！', '', ''],
  'czsb': ['操作失败！', '操作失敗！', '', ''],

  'qrsc':['确认删除?', '確認刪除?', '', ''],
  'qr': ['确认', '確認', '', ''],
  'qx': ['取消', '取消', '', ''],

  'ybdjslb': ['已绑定角色列表', '已綁定角色列表', '', ''],

  'ccxry': ['创建新人员', '創建新人員', '', ''],
  'bdyh': ['绑定用户', '綁定用戶', '', ''],
  'jcbd': ['解除绑定', '解除綁定', '', ''],
  'dxjslb': ['待选择角色列表', '待選擇角色列表', '', ''],
  'yhjssz': ['用户角色设置', '用戶角色設置', '', ''],
  'czmm': ['重置密码', '重置密碼', '', ''],

  'g*t': [x => `共${x}条`, x => `共${x}條`, x => `共${x}條`, x => `共${x}條`],//这个是表个下面的数据总数  '共10条' ,不会写就把翻译写在这个后面  由开发人员套上去


  //以下是角色頁面專有的語句
  'role01': ['删除角色将会一并删除为该角色配置的权限信息，确认删除吗？', '刪除角色將會一併刪除為該角色配置的許可權資訊，確認刪除嗎？'],
  'role02': ['角色删除操作慎重提示', '角色刪除操作慎重提示', '', ''],
  'role03': ['该角色已绑定用户，请先解除绑定后再删除！', '該角色已綁定用戶，請先解除綁定後再刪除！', '', ''],
  'role04':['权限设置','許可權設置','',''],
  'role05':['用户绑定','用戶綁定','',''],
  'role06':['角色列表','角色列表','',''],
};

export default i18n;
